data_generation/simulation_results/of/case_0/constant/simParams
nIter 2000;
hComponent0 1400.3970745221104;
hComponent1 1436.7065815609976;
hComponent2 975.9129713881564;
hComponent3 689.2119135104796;
hComponent4 991.1254294131487;kComponent0 68.56103754607183;
kComponent1 13.25197260882247;
kComponent2 74.20286549462033;
kComponent3 75.22458757087851;
kComponent4 75.48194314801874;
tAmbient 300;
Ux 2.463280048037945;
kPCB 0.553488361923697;